/*
* Copyright (c) 2026, Wuhan CUG Co.,Ltd
* All rights reserved.
*
* Filename: mian
* Description:
*
* Version: 1.0
* Author: 王新疆
* Date: 2026/4/18 8:11:27
*/

#include <iostream>
#include <cstring>
#include "Cattoy.h"
#include "Beartoy.h"

using namespace std;

static void play(toy* ptr, int i = 0)
{
	if (i == 0) {
		ptr->singing();
	}
	else if (i == 1) {
		ptr->dancing();
	}
}

int main()
{

	Cattoy c1, c2("我能梦想到往昔时光\n那时生活多么美好", "胡桃夹子\n糖果仙子舞");
	Beartoy b1, b2("一只白鸽要飞过多少片大海\n才能在沙丘安眠", "堂.吉诃德\n风车旁的吉卜赛营地");

	toy t;
	t = c1;	play(&t); play(&t, 1);// toy singing toy dancing
	t = b1;	play(&t); play(&t, 1);// toy singing toy dancing

	toy* p;
	p = &c2;	play(p); play(p, 1);
	p = &b2;	play(p); play(p, 1);
	p = &c1;	play(p); play(p, 1);
	p = &b1;	play(p); play(p, 1);
	return 0;
}

// 输出样例：
// toy singing
// toy dancing
// toy singing
// toy dancing
// ----------------------猫猫唱歌----------------------
// 我能梦想到往昔时光
// 那时生活多么美好
// ----------------------猫猫唱歌----------------------
// 
// ----------------------猫猫跳舞----------------------
// 胡桃夹子
// 糖果仙子舞
// ----------------------猫猫跳舞----------------------
// 
// ----------------------小熊唱歌----------------------
// 一只白鸽要飞过多少片大海
// 才能在沙丘安眠
// ----------------------小熊唱歌----------------------
// 
// ----------------------小熊跳舞----------------------
// 堂.吉诃德
// 风车旁的吉卜赛营地
// ----------------------小熊跳舞----------------------
// 
// ----------------------猫猫唱歌----------------------
// 喵喵喵~~~~
// ----------------------猫猫唱歌----------------------
// 
// ----------------------猫猫跳舞----------------------
// 转圈圈@@@@
// ----------------------猫猫跳舞----------------------
// 
// ----------------------小熊唱歌----------------------
// 喔呜呜####
// ----------------------小熊唱歌----------------------
// 
// ----------------------小熊跳舞----------------------
// 跺跺脚&&&&
// ----------------------小熊跳舞----------------------
// 